Revit 2024 API
SheetDuplicateOption Enumeration
 Options for duplicating sheets
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Since: 2023
Syntax
C#
public enum SheetDuplicateOption
Visual Basic
Public Enumeration SheetDuplicateOption
Visual C++
public enum class SheetDuplicateOption
Members
Member name | Description
DuplicateEmptySheet |  Duplicate the sheet, only copy its title block.
DuplicateSheetWithDetailing |  Duplicate the sheet, copy the title block and details.
DuplicateSheetWithViewsOnly |  Duplicate the sheet. Copy its title block, details, viewports and contained views. The newly created sheet will reference the newly duplicated views.
DuplicateSheetWithViewsAndDetailing |  Duplicate the sheet. Copy its title block, details, viewports, and duplicate its contained views with detailing. The newly created sheet will reference the newly duplicated views.
DuplicateSheetWithViewsAsDependent |  Duplicate the sheet. Copy its title block, details, viewports, and duplicate its contained views as dependent. The newly created sheet will reference the newly duplicated dependent views.
See Also
Autodesk.Revit.DB Namespace